Config/Documents/ПоступлениеБСО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеБСО</Name>
			<BasedOn>
				<xr:Item>Document.АктСписанияМЗ</xr:Item>
				<xr:Item>Document.ТребованиеНакладная0315006</xr:Item>
				<xr:Item>Document.ВедомостьНаВыдачуМЗНаНуждыУчреждения</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДвиженияБСО</xr:Item>
				<xr:Item>AccountingRegister.ЖурналПроводокЕПСБУ</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПервичногоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервичногоДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НомерПервичногоДокумента</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦМО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦМО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВедомостьНаВыдачуМЗНаНуждыУчреждения</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияКассы</v8:Type>
						<v8:Type>cfg:DocumentRef.АктСписанияМЗ</v8:Type>
						<v8:Type>cfg:DocumentRef.ТребованиеНакладная0315006</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризационнаяОписьБСО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КФО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КВД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДИсточника</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйИсполнительБух</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоставБСО</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БСО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияБСО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииБСО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНачальный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерКонечный</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/Enums/ТипыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тара</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Госуслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Блюдо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГСМ</Name>
					<Comment>Горюче-смазочные материалы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Медикаменты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МолоднякИЖивотныеНаОткорме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МягкийИнвентарь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГруппаУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Посуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродуктыПитания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеМЗ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стройматериалы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УслугиАренды</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БСО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БиологическиеАктивы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/Catalogs/ЦМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЦМО</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеАктуален</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/Documents/ПоступлениеБСО/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// См. УправлениеДоступом.ЗаполнитьНаборыЗначенийДоступа.
Процедура ЗаполнитьНаборыЗначенийДоступа(Таблица) Экспорт
	
	// Логика ограничения:
	// Чтения:     Организация
	// Изменения:  Организация
	
	// Чтение, Изменение: набор №0.
	Строка = Таблица.Добавить();
	Строка.ЗначениеДоступа = Организация;
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	
	// Инициализация данных документа
	Документы.ПоступлениеБСО.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

    // Движения по денежным средствам.
	ПроведениеСервер.ОтразитьДвиженияПоРегистру(ДополнительныеСвойства, Движения, Отказ, "ДвиженияБСО")
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Инициализация дополнительных свойств для проведения документа
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);
	
	// Подготовка наборов записей
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	
	// Запись наборов записей
	ПроведениеСервер.ЗаписатьНаборыЗаписей(ЭтотОбъект);
	
	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если (НЕ ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоПодразделениям"))
		ИЛИ (Не БухгалтерскийУчетПовтИсп.ПолучитьСвойстваСчета(ЭтотОбъект.СчетУчета).УчетПоПодразделениям) Тогда
		НеПроверяемыеРеквизиты = Новый Массив;
		НеПроверяемыеРеквизиты.Добавить("Подразделение");
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НеПроверяемыеРеквизиты);
	КонецЕсли;
	
	ТаблицаБСО = Новый ТаблицаЗначений;
	ТаблицаБСО.Колонки.Добавить("БСО", Новый ОписаниеТипов("СправочникСсылка.БСО"));
	ТаблицаБСО.Колонки.Добавить("СерияБСО", Новый ОписаниеТипов("СправочникСсылка.СерииБСО"));
	ТаблицаБСО.Колонки.Добавить("НомерНачальный", Новый ОписаниеТипов("Число"));
	ТаблицаБСО.Колонки.Добавить("НомерКонечный", Новый ОписаниеТипов("Число"));
	ТаблицаБСО.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число"));
	Для каждого ТекСтр Из СоставБСО Цикл
	
		НовСтр = ТаблицаБСО.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтр, ТекСтр, "БСО, СерияБСО, НомерСтроки");
		НовСтр.НомерНачальный = Число(ТекСтр.НомерНачальный);
		НовСтр.НомерКонечный = Число(?(ЗначениеЗаполнено(ТекСтр.НомерКонечный),ТекСтр.НомерКонечный,ТекСтр.НомерНачальный));
	
	КонецЦикла; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоставБСО.БСО,
	               |	СоставБСО.СерияБСО,
	               |	СоставБСО.НомерСтроки,
	               |	СоставБСО.НомерНачальный,
	               |	СоставБСО.НомерКонечный
	               |ПОМЕСТИТЬ СоставБСО
	               |ИЗ
	               |	&СоставБСО КАК СоставБСО
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	СоставБСО.НомерСтроки,
	               |	1 КАК Приоритет
	               |ПОМЕСТИТЬ Ошибки
	               |ИЗ
	               |	СоставБСО КАК СоставБСО
	               |ГДЕ
	               |	СоставБСО.НомерНачальный = 0
	               |	И СоставБСО.НомерКонечный = 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СоставБСО.НомерСтроки,
	               |	2
	               |ИЗ
	               |	СоставБСО КАК СоставБСО
	               |ГДЕ
	               |	СоставБСО.НомерНачальный = 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СоставБСО.НомерСтроки,
	               |	3
	               |ИЗ
	               |	СоставБСО КАК СоставБСО
	               |ГДЕ
	               |	СоставБСО.НомерКонечный = 0
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СоставБСО.НомерСтроки,
	               |	4
	               |ИЗ
	               |	СоставБСО КАК СоставБСО
	               |ГДЕ
	               |	СоставБСО.НомерКонечный < СоставБСО.НомерНачальный
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СоставБСО.НомерСтроки,
	               |	5
	               |ИЗ
	               |	СоставБСО КАК СоставБСО
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставБСО КАК СоставБСО1
	               |		ПО СоставБСО.БСО = СоставБСО1.БСО
	               |			И СоставБСО.СерияБСО = СоставБСО1.СерияБСО
	               |			И СоставБСО.НомерНачальный >= СоставБСО1.НомерНачальный
	               |			И СоставБСО.НомерНачальный <= СоставБСО1.НомерКонечный
	               |			И СоставБСО.НомерСтроки > СоставБСО1.НомерСтроки
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СоставБСО.НомерСтроки,
	               |	6
	               |ИЗ
	               |	СоставБСО КАК СоставБСО
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставБСО КАК СоставБСО1
	               |		ПО СоставБСО.БСО = СоставБСО1.БСО
	               |			И СоставБСО.СерияБСО = СоставБСО1.СерияБСО
	               |			И СоставБСО.НомерКонечный >= СоставБСО1.НомерНачальный
	               |			И СоставБСО.НомерКонечный <= СоставБСО1.НомерКонечный
	               |			И СоставБСО.НомерСтроки > СоставБСО1.НомерСтроки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Ошибки.НомерСтроки КАК НомерСтроки,
	               |	МИНИМУМ(Ошибки.Приоритет) КАК Приоритет
	               |ИЗ
	               |	Ошибки КАК Ошибки
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Ошибки.НомерСтроки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("СоставБСО", ТаблицаБСО);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Приоритет = 1 Тогда
			ТекстОшибки = НСтр("ru='В строке %1 не заполнены начальный и конечный номера'");
			ИмяПоля = "НомерНачальный";
		ИначеЕсли Выборка.Приоритет = 2 Тогда
			ТекстОшибки = НСтр("ru='В строке %1 не заполнен начальный номер'");
			ИмяПоля = "НомерНачальный";
		ИначеЕсли Выборка.Приоритет = 3 Тогда
			ТекстОшибки = НСтр("ru='В строке %1 не заполнен конечный номер'");
			ИмяПоля = "НомерКонечный";
		ИначеЕсли Выборка.Приоритет = 4 Тогда
			ТекстОшибки = НСтр("ru='В строке %1 конечный номер меньше начального'");
			ИмяПоля = "НомерКонечный";
		ИначеЕсли Выборка.Приоритет = 5 Тогда
			ТекстОшибки = НСтр("ru='В строке %1 начальный номер входит в интервал из предыдущих строк'");
			ИмяПоля = "НомерНачальный";
		Иначе
			ТекстОшибки = НСтр("ru='В строке %1 конечный номер входит в интервал из предыдущих строк'");
			ИмяПоля = "НомерКонечный";
		КонецЕсли;
		
		ОбщегоНазначения.СообщитьПользователю(	СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, Выборка.НомерСтроки),
															,"Объект.СоставБСО["+(Выборка.НомерСтроки-1)+"]."+ИмяПоля,,Отказ);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ЭтоСписаниеМЗ(ДанныеЗаполнения) Тогда
		ЗаполнитьПоСписаниюМЗ(ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ЭтоЗаполнениеНаОснованииИнвентаризации0510465(ДанныеЗаполнения) Тогда
		ЗаполнитьПоИнвентаризации0510465(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		ДокОснование = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Основание");
		
		Если ТипЗнч(ДокОснование) = Тип("ДокументСсылка.ИнвентаризацияКассы") Тогда
			СтандартнаяОбработка = Ложь;
			Документы.ИнвентаризацияКассы.ВводНаОсновании_ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);
		ИначеЕсли ЭтоСписаниеМЗ(ДокОснование) Тогда
			ЗаполнитьПоСписаниюМЗ(ДокОснование, СтандартнаяОбработка);
			ЗаполнитьТабличнуюЧастьПриВводеНаОсновании(ДанныеЗаполнения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьТабличнуюЧастьПриВводеНаОсновании(ДанныеЗаполнения = Неопределено)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЦМООснования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "ЦМО", Справочники.ЦМО.ПустаяСсылка());
		ПодразделениеОснования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "Подразделение", Справочники.Подразделения.ПустаяСсылка());
		КФООснования = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДанныеЗаполнения, "КФО", Перечисления.КВД.ПустаяСсылка());
	Иначе
		ДанныеКФОЦМО = ПолучитьЕдинственныйЦМОКФО(ДокументОснование);
		ЦМООснования = ДанныеКФОЦМО.ЦМО;
		ПодразделениеОснования = ДанныеКФОЦМО.Подразделение;
		КФООснования = ДанныеКФОЦМО.КФО;
	КонецЕсли;
	Если ЗначениеЗаполнено(ЦМООснования) И ЗначениеЗаполнено(КФООснования) Тогда
		ЦМО = ЦМООснования;
		Подразделение = ПодразделениеОснования;
		КФО = КФООснования;
		Для Каждого Строка Из Документы.ПоступлениеБСО.ТаблицаДокументаОснования(ДокументОснование, КФООснования, ЦМООснования, ПодразделениеОснования) Цикл
			ЗаполнитьЗначенияСвойств(СоставБСО.Добавить(), Строка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьЕдинственныйЦМОКФО(Основание)
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаПолученияКФОЦМО(Основание);
	Запрос.УстановитьПараметр("Ссылка", Основание);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Новый Структура;
	Результат.Вставить("ЦМО", Справочники.ЦМО.ПустаяСсылка());
	Результат.Вставить("КФО", Перечисления.КВД.ПустаяСсылка());
	Результат.Вставить("Подразделение", Справочники.Подразделения.ПустаяСсылка());
	Если Выборка.Количество() = 1 И Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция ТекстЗапросаПолученияКФОЦМО(Основание)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.АктСписанияМЗ") Тогда
		Возврат
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	АктСписанияМЗМатериалы.КФО,
		|	АктСписанияМЗМатериалы.Ссылка.ЦМООтправитель КАК ЦМО,
		|	АктСписанияМЗМатериалы.Ссылка.ПодразделениеОтправитель КАК Подразделение
		|ИЗ
		|	Документ.АктСписанияМЗ.Материалы КАК АктСписанияМЗМатериалы
		|ГДЕ
		|	АктСписанияМЗМатериалы.Ссылка = &Ссылка
		|	И АктСписанияМЗМатериалы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БСО)";
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ТребованиеНакладная0315006") Тогда
		Возврат
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ТребованиеНакладная0315006Материалы.КФО,
		|	ТребованиеНакладная0315006Материалы.Ссылка.ЦМОПолучатель КАК ЦМО,
		|	ТребованиеНакладная0315006Материалы.Ссылка.ПодразделениеПолучатель КАК Подразделение
		|ИЗ
		|	Документ.ТребованиеНакладная0315006.Материалы КАК ТребованиеНакладная0315006Материалы
		|ГДЕ
		|	ТребованиеНакладная0315006Материалы.Ссылка = &Ссылка
		|	И ТребованиеНакладная0315006Материалы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БСО)";
	ИначеЕсли ТипЗнч(Основание) = Тип("ДокументСсылка.ВедомостьНаВыдачуМЗНаНуждыУчреждения") Тогда
		Возврат
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериальныеЗапасы.ЦМОПолучатель КАК ЦМО,
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериальныеЗапасы.ПодразделениеПолучатель КАК Подразделение,
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериальныеЗапасы.Ссылка.КФО
		|ИЗ
		|	Документ.ВедомостьНаВыдачуМЗНаНуждыУчреждения.МатериальныеЗапасы КАК
		|		ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериальныеЗапасы
		|ГДЕ
		|	ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериальныеЗапасы.Ссылка = &Ссылка
		|	И ВедомостьНаВыдачуМЗНаНуждыУчрежденияМатериальныеЗапасы.Номенклатура.ТипНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.БСО)";
	Иначе
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Не известный тип документа (%1) в функции Документы.ПоступлениеБСО.ТекстЗапросаПолученияКФОЦМО'"), ТипЗнч(Ссылка));
	КонецЕсли;
	
КонецФункции

Функция ЭтоСписаниеМЗ(ДанныеЗаполнения)
	Возврат ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктСписанияМЗ")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТребованиеНакладная0315006")
		Или ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьНаВыдачуМЗНаНуждыУчреждения");
КонецФункции

Процедура ЗаполнитьПоСписаниюМЗ(ДанныеЗаполнения, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.АктСписанияМЗ") Тогда
		ЗаполнитьПоАктуСписанияМЗ(ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ТребованиеНакладная0315006") Тогда
		ЗаполнитьНаОснованииТребованияНакладнойМЗ(ДанныеЗаполнения, СтандартнаяОбработка);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВедомостьНаВыдачуМЗНаНуждыУчреждения") Тогда
		ЗаполнитьНаОснованииВедомостиНаВыдачуМЗНаНуждыУчреждения(ДанныеЗаполнения, СтандартнаяОбработка);
	КонецЕсли;
	ЗаполнитьТабличнуюЧастьПриВводеНаОсновании();
	
КонецПроцедуры

Процедура ЗаполнитьПоАктуСписанияМЗ(АктСписанияСсылка, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	АктСписанияМЗ.Организация,
	|	АктСписанияМЗ.ИФО,
	|	АктСписанияМЗ.ПодразделениеОтправитель КАК Подразделение,
	|	АктСписанияМЗ.ЦМООтправитель КАК ЦМО,
	|	АктСписанияМЗ.Ссылка КАК ДокументОснование,
	|	АктСписанияМЗ.КФО,
	|	АктСписанияМЗ.Дата
	|ИЗ
	|	Документ.АктСписанияМЗ КАК АктСписанияМЗ
	|ГДЕ
	|	АктСписанияМЗ.Ссылка = &АктСписанияСсылка";
	Запрос.УстановитьПараметр("АктСписанияСсылка", АктСписанияСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитыЗаполнения = ЗаполнениеРеквизитовОбъектов.ПолучитьЗначенияРеквизитовЗаполнения(Метаданные().ПолноеИмя(), Выборка.Дата);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаполнения);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	Иначе
		РеквизитыЗаполнения = ЗаполнениеРеквизитовОбъектов.ПолучитьЗначенияРеквизитовЗаполнения(Метаданные().ПолноеИмя());
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииТребованияНакладнойМЗ(ТребованиеНакладная, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТребованиеНакладная0315006.Организация,
	|	ТребованиеНакладная0315006.ИФО,
	|	ТребованиеНакладная0315006.ПодразделениеОтправитель КАК Подразделение,
	|	ТребованиеНакладная0315006.ЦМОПолучатель КАК ЦМО,
	|	ТребованиеНакладная0315006.Ссылка КАК ДокументОснование,
	|	ТребованиеНакладная0315006.Дата
	|ИЗ
	|	Документ.ТребованиеНакладная0315006 КАК ТребованиеНакладная0315006
	|ГДЕ
	|	ТребованиеНакладная0315006.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ТребованиеНакладная);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РеквизитыЗаполнения = ЗаполнениеРеквизитовОбъектов.ПолучитьЗначенияРеквизитовЗаполнения(Метаданные().ПолноеИмя(), Выборка.Дата);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаполнения);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	Иначе
		РеквизитыЗаполнения = ЗаполнениеРеквизитовОбъектов.ПолучитьЗначенияРеквизитовЗаполнения(Метаданные().ПолноеИмя(), Выборка.Дата);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНаОснованииВедомостиНаВыдачуМЗНаНуждыУчреждения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВедомостьНаВыдачуМЗНаНуждыУчреждения.Организация,
	|	ВедомостьНаВыдачуМЗНаНуждыУчреждения.ИФО,
	|	ВедомостьНаВыдачуМЗНаНуждыУчреждения.КФО КАК КФО,
	|	ВедомостьНаВыдачуМЗНаНуждыУчреждения.Ссылка КАК ДокументОснование,
	|	ВедомостьНаВыдачуМЗНаНуждыУчреждения.Дата
	|ИЗ
	|	Документ.ВедомостьНаВыдачуМЗНаНуждыУчреждения КАК ВедомостьНаВыдачуМЗНаНуждыУчреждения
	|ГДЕ
	|	ВедомостьНаВыдачуМЗНаНуждыУчреждения.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();

	СтандартнаяОбработка = Ложь;
	Если Выборка.Следующий() Тогда
		РеквизитыЗаполнения = ЗаполнениеРеквизитовОбъектов.ПолучитьЗначенияРеквизитовЗаполнения(Метаданные().ПолноеИмя(), Выборка.Дата);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаполнения);
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	Иначе
		РеквизитыЗаполнения = ЗаполнениеРеквизитовОбъектов.ПолучитьЗначенияРеквизитовЗаполнения(Метаданные().ПолноеИмя());
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыЗаполнения);
	КонецЕсли;
КонецПроцедуры

Функция ЭтоЗаполнениеНаОснованииИнвентаризации0510465(ДанныеЗаполнения)
	Возврат ТипЗнч(ДанныеЗаполнения) = Тип("Структура")
		И ДанныеЗаполнения.Свойство("ДокументОснование")
		И ТипЗнч(ДанныеЗаполнения.ДокументОснование) = Тип("ДокументСсылка.ИнвентаризационнаяОписьБСО")
		И ДанныеЗаполнения.Свойство("Разделитель");
КонецФункции

// Заполнить по инвентаризации 0510465.
// 
// Параметры:
//  ДанныеЗаполнения - Структура:
//   * Разделитель - Структура
//   * ДокументОснование - ДокументСсылка.ИнвентаризационнаяОписьБСО
Процедура ЗаполнитьПоИнвентаризации0510465(ДанныеЗаполнения)
	СоставБСО.Очистить();
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Разделитель);
	ДокументОснование = ДанныеЗаполнения.ДокументОснование;
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация"));
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ОбщегоНазначения.ТекущаяДатаПользователя();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(СчетУчета) Тогда
		СчетУчета = БухгалтерскийУчет.СчетПоКоду("03.1", Дата, Организация);
	КонецЕсли;
	Документы.ПоступлениеБСО.ЗаполнитьПоИнвентаризации0510465(
		ДанныеЗаполнения.ДокументОснование,
		ЭтотОбъект)
КонецПроцедуры

#КонецОбласти

#КонецЕсли
